// 1. Создайте функцию, которая выводит сообщение в консоль через 3 секунды 
// с использованием setTimeout.

// 2. Напишите программу, которая выводит числа от 1 до 10 в консоль с 
// //интервалом в 1 секунду, используя setInterval.

// //3. Создайте счетчик, который начинает с 1 и увеличивается каждую секунду, 
// //выводя его значение в консоль с использованием setInterval. 
// ///Остановите счетчик после достижения определенного значения.

// //4. Реализуйте функцию, которая выполняет определенную задачу через 
// //определенное количество секунд, переданное как аргументы, с 
// //использованием setTimeout.

// //5. Напишите скрипт, который создает анимацию изменения цвета фона 
// страницы, меняя цвет каждую секунду с использованием setInterval. 
// *document.body.style.backgroundColor*

// //6. Создайте таймер обратного отсчета, который выводит оставшееся время в формате "ММ:СС" с использованием setInterval.

// 7. Напишите функцию, которая будет выполнять определенную задачу каждые 
// 2 секунды с использованием setInterval, но остановится после 10 повторений.

// 8. Разработайте игру "Камень, ножницы, бумага" между пользователем и 
// компьютером, где компьютер делает ход каждые 5 секунд после хода 
// пользователя с использованием setInterval.

// 9. Создайте слайд-шоу изображений, которое автоматически переключается на 
// следующее изображение каждые 5 секунд с использованием setInterval. 
// *document.body.style.backgroundImage*

// 10. Напишите функцию, которая анимирует появление элемента на странице с 
// плавным появлением через определенное количество секунд, используя setTimeout.